Repository: django-import-export/django-import-export
Catalog: import_export/locale/*/LC_MESSAGES/django.po
Languages: fr, he, uk

source: Import
fr: Importer
he: ייבוא
uk: Імпорт

source: %s through import_export
fr: %s via import_export
he: %s באמצעות ייבוא/ייצוא
uk: %s через import_export

source: Import finished: {} new, {} updated, {} deleted and {} skipped {}.
fr: Importation terminée: {} nouveaux, {} modifiés, {} supprimés et {} sautés pour les {}.
he: הייבוא הסתיים: נוספו {}, עודכנו {}, נמחקו {}, דולגו {}.
uk: Імпорт завершено: {} додано, {} оновлено, {} видалено and {} проігноровано {}.

source: %(exc_name)s encountered while trying to read file. Ensure you have chosen the correct format for the file.
fr: Erreur %(exc_name)s pendant la lecture du fichier. Assurez-vous d’avoir choisi le bon format pour le fichier.
he: שגיאת %(exc_name)s אירעה בקריאת הקובץ. ודאו שבחרתם את פורמט הקובץ הנכון.
uk: Під час читання фалу виникла проблема %(exc_name)s. Переконайтесь, що ви обрали правильний формат для файлу.

source: No valid data to import. Ensure your file has the correct headers or data for import.
fr: Pas de données valides importables. Assurez-vous que le fichier contient des en-têtes ou données correctes pour l’importation.
he: לא נמצא מידע תקין לייבוא. יש לוודא שהכותרות והנתונים בקובץ תקינים ומתאימים לייבוא.
uk: Бракує даних для імпорту. Переконайтесь, що ваш файл містить правильні заголовки та значення для імпорту.

source: Export
fr: Exporter
he: ייצוא
uk: Експорт

source: Export selected %(verbose_name_plural)s
fr: Exporter %(verbose_name_plural)s selectionné(e)s
he: ייצוא %(verbose_name_plural)s שנבחרו
uk: Експортувати вибрані %(verbose_name_plural)s

source: export failed due to IllegalCharacterError
fr: exportation échouée à cause de IllegalCharacterError
he: הייצוא נכשל עקב שגיאת תו לא חוקי (IllegalCharacterError)
uk: помилка експорту через недопустимі символі

source: Resource
fr: Ressource
he: משאב
uk: Ресурс

source: Format
he: פורמט
uk: Формат

source: File to import
fr: Fichier à importer
he: קובץ לייבוא
uk: Файл для імпорту

source: Form is not validated, call `is_valid` first
fr: Le formulaire n’est pas validé, appeler d’abord `is_valid`
he: הטופס לא אומת, יש לקרוא לפונקציה `is_valid` תחילה
uk: Форма не перевірена, скористайтесь `is_valid` одразу

source: Select at least 1 field for "%(resource_name)s" to export
fr: Sélectionner au moins 1 champ pour "%(resource_name)s" pour exporter
he: יש לבחור לפחות שדה אחד לייצוא עבור "%(resource_name)s"
uk: Виберіть щонайменше 1 поле "%(resource_name)s" для експорту

source: The following fields are declared in 'import_id_fields' but are not present in the resource fields: %s
fr: Les champs suivants sont déclarés dans 'import_id_fields' mais ne sont pas présents dans les champs de la ressource: %s
he: השדות הבאים הוגדרו ב-'import_id_fields' אך אינם קיימים בשדות המשאב: %s
uk: Наступні поля були вказані в 'import_id_fields', але не присутні в полях ресурсу: %s

source: The following fields are declared in 'import_id_fields' but are not present in the file headers: %s
fr: Les champs suivants sont déclarés dans 'import_id_fields' mais ne sont pas présents dans les en-têtes du fichier: %s
he: השדות הבאים הוגדרו ב-'import_id_fields' אך אינם קיימים בכותרות הקובץ: %s
uk: Наступні поля були вказані в 'import_id_fields', але не присутні в заголовках файлу: %s

source: call to force_str() on instance failed: %s
fr: un appel à force_str() sur une instance a échoué: %s
he: הקריאה ל-force_str() על המופע נכשלה: %s
uk: помилка виклику force_str() на екземплярі: %s

source: Home
fr: Accueil
he: דף הבית
uk: Домівка

source: Export %(len)s selected item.
fr: Exporter %(len)s élément sélectionné.
he: ייצוא הפריט שנבחר
uk: Експорт %(len)s вибраної колонки.

source: This exporter will export the following fields:
fr: Cet exportateur va exporter les champs suivants:
he: הייצוא יכלול את השדות הבאים:
uk: Цей експорт вивантажить наступні поля:

source: Select all
uk: Вибрати все

source: Submit
fr: Soumettre
he: שליחה
uk: Ок

source: Below is a preview of data to be imported. If you are satisfied with the results, click 'Confirm import'
fr: Voici un aperçu des données à importer. Si vous êtes satisfait(e) des résultats, cliquez sur 'Confirmer l’importation'
he: להלן תצוגה מקדימה של הנתונים לייבוא. אם התוצאות נראות תקינות, לחצו על 'אשר ייבוא'.
uk: Нижче - попередній перегляд даних, що будуть імпортовані. Якщо вас все влаштовує, натисніть 'Підтвердити імпорт'

source: Confirm import
fr: Confirmer l’importation
he: אשר ייבוא
uk: Підтвердити імпорт

source: Errors
fr: Erreurs
he: שגיאות
uk: Помилки

source: Line number
fr: Numéro de ligne
he: מספר שורה
uk: Номер рядка

source: Some rows failed to validate
fr: Certaines lignes ont échoué à la validation
he: אימות מספר שורות נכשל
uk: Деякі рядки не пройшли перевірку

source: Please correct these errors in your data where possible, then reupload it using the form above.
fr: Veuillez corriger ces erreurs dans les données si possible, puis envoyer à nouveau en utilisant le formulaire ci-dessus.
he: יש לתקן את השגיאות בקובץ המקורי במידת האפשר, ולטעון אותו מחדש באמצעות הטופס למעלה.
uk: Будь ласка, виправте помилки у вашому файлі та завантажте його знову використовуючи форму вище.

source: Row
fr: Ligne
he: שורה
uk: Рядок

source: Non field specific
fr: Non spécifique à un champ
he: לא קשור לשדה מסוים
uk: Невідома помилка

source: Preview
fr: Aperçu
he: תצוגה מקדימה
uk: Попередній перегляд

source: New
fr: Nouveau
he: חדש
uk: Нових

source: Skipped
fr: Ignoré
he: דולג
uk: Пропущено

source: Delete
fr: Supprimer
he: מחיקה
uk: Видалено

source: Update
fr: Mettre à jour
he: עדכון
uk: Оновлено

source: This importer will import the following fields:
fr: Cet importateur va importer les champs suivants:
he: הייבוא יכלול את השדות הבאים:
uk: Цей імпорт вивантажить наступні колонки:

source: Value could not be parsed.
fr: La valeur n’a pas pu être interprétée.
he: לא ניתן היה לפענח את הערך.
uk: Не вдалося розібрати значення.

source: use_natural_foreign_keys and key_is_id cannot both be True
fr: use_natural_foreign_keys et key_is_id ne peuvent pas être True en même temps
he: לא ניתן להפעיל את ההגדרות 'use_natural_foreign_keys' ו-'key_is_id' בו-זמנית.
uk: use_natural_foreign_keys та key_is_id не можуть бути True одночасно
